#МНОЖЕСТВО
#хранит только уникальные обьекты
#Множество изменяемый а элементы нет,похож на список
shop=set(['honor','readmi','nokia',])
print(shop)


#СПИСОК, 
#изменяемый, составной обьект , можно изменять элементы списка
#выводит значение по индексу
shop=['honor','readmi','nokia']
s =int(input('Введите ключ для выбора телефона 0-honor, 1-readmi, 2-nokia :'))
print([s])


#СЛОВАРЬ
# По ключу выводит значение,
shop={1:'honor',2:'readmi',3:'nokia'}
b = int(input('Введите ключ для выбора телефона 0-honor, 1-readmi, 2-nokia :'))
print([b])

